
(___.toFixed(0))  //ใส่ทศนิยมให้ เเต่ ไม่ออกมาเป็นตัวเลข ออกมาเป็นตัวหนังสือ   ตรงเลข0 ให้ใส่ตัวเลขที่ต้องการให้เเสดงทศนิยมกี่ตัว
(x.toLocaleString())  //ใส่ลูกน้ำให้
(___.length) //นับตัวอักษรให้ว่ามีกี่ตัว
(___.charAt(0)) //เรียกตัวอักษรในประโยค หรือ ดึงตัวอักษรจากประโยค เริ่มต้นที่0 เช็คตำเเหน่งตัวอักษรนั้น ว่าตำเเหน่งนั้นคือตัวอักษรอะไร
(___.trimStart()) //เอาช่องว่างช่วงเเรกออก
(___.trimEnd()) //เอาช่องว่างข้องหลังออก
(___.trim()) //เอาช่องว่างข้างหน้าเเละหลังออก
(___.toUpperCase())//ทำให้เป็นพิมพ์ใหญ่ทั้งหมด
(___.toLowerCase())// ทำให้เป็นพิมพ์เล็ก
(___.indexOf('?'))//หาตัวอักษรนั้นว่าอยุ่ตำเเหน่งที่เท่าไหร่     ตรง ? ให้ใส่ตัวอักษรที่ต้องการหา
(___.includes('?'))// ถามว่าในข้อความนั้นๆ มีคำหรือ ตัวอักษรนี้จริงๆหรือป่าว จริง หรือ ไม่จริง ตรง ? ให้ใส่คำหรือ ตัวอักษร ที่ต้องการ